In [1]:
import pandas as pd

In [2]:
air_quality = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/air_quality_no2.csv')
air_quality.head(2)

              datetime  station_antwerp  station_paris  station_london
0  2019-05-07 02:00:00              NaN            NaN            23.0
1  2019-05-07 03:00:00             50.5           25.0            19.0

# 기존 컬럼에 숫자 곱하기

In [ ]:
air_quality['london_mg_per_cubic']=air_quality['station_london'] * 1.882

In [ ]:
air_quality.head(2)

              datetime  station_antwerp  ...  station_london  london_mg_per_cubic
0  2019-05-07 02:00:00              NaN  ...            23.0               43.286
1  2019-05-07 03:00:00             50.5  ...            19.0               35.758

[2 rows x 5 columns]

In [ ]:
air_quality['test'] = 1.882
air_quality

                 datetime  station_antwerp  ...  london_mg_per_cubic   test
0     2019-05-07 02:00:00              NaN  ...               43.286  1.882
1     2019-05-07 03:00:00             50.5  ...               35.758  1.882
2     2019-05-07 04:00:00             45.0  ...               35.758  1.882
3     2019-05-07 05:00:00              NaN  ...               30.112  1.882
4     2019-05-07 06:00:00              NaN  ...                  NaN  1.882
...                   ...              ...  ...                  ...    ...
1030  2019-06-20 22:00:00              NaN  ...                  NaN  1.882
1031  2019-06-20 23:00:00              NaN  ...                  NaN  1.882
1032  2019-06-21 00:00:00              NaN  ...                  NaN  1.882
1033  2019-06-21 01:00:00              NaN  ...                  NaN  1.882
1034  2019-06-21 02:00:00              NaN  ...                  NaN  1.882

[1035 rows x 6 columns]

### element_wise 기능이 좋은 점은?

아래와 같이 복잡한 작업을 위와 같이 쉽게 처리해주기 때문!

In [ ]:
a = [1,2,3,4]
a

[1, 2, 3, 4]

In [ ]:
a*2

[1, 2, 3, 4, 1, 2, 3, 4]

In [ ]:
b = []

for i in a:
  b.append(i*2)

In [ ]:
b

[2, 4, 6, 8]

# 컬럼끼리 연산하기

In [ ]:
air_quality['ratio_paris_antwerp'] = air_quality['station_paris'] / air_quality['station_antwerp']
air_quality

                 datetime  station_antwerp  ...   test  ratio_paris_antwerp
0     2019-05-07 02:00:00              NaN  ...  1.882                  NaN
1     2019-05-07 03:00:00             50.5  ...  1.882             0.495050
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1035 rows x 7 columns]

# 컬럼 이름 수정

In [ ]:
# air_quality.rename(columns={'station_london':'FR04014'})  이렇게만 하면 air_quality 프레임 자체가 바뀐 것은 아니기 때문에 덮어 씌우거나 새로운 df를 지칭해줘야 함
air_quality_renamed = air_quality.rename(columns={'station_london':'FR04014'})
air_quality_renamed

                 datetime  station_antwerp  ...   test  ratio_paris_antwerp
0     2019-05-07 02:00:00              NaN  ...  1.882                  NaN
1     2019-05-07 03:00:00             50.5  ...  1.882             0.495050
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1035 rows x 7 columns]

In [ ]:
air_quality_renamed_upper = air_quality.rename(columns=str.upper) # columns을 전부 대문자로 바꿔줌, 소문자로 바꾸고 싶으면 lower
air_quality_renamed_upper

                 DATETIME  STATION_ANTWERP  ...   TEST  RATIO_PARIS_ANTWERP
0     2019-05-07 02:00:00              NaN  ...  1.882                  NaN
1     2019-05-07 03:00:00             50.5  ...  1.882             0.495050
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1035 rows x 7 columns]

# 특정 컬럼 삭제하기

In [ ]:
df = air_quality.drop(['station_antwerp','station_london'],axis=1)
df.head(2)

              datetime  station_paris  ...   test  ratio_paris_antwerp
0  2019-05-07 02:00:00            NaN  ...  1.882                  NaN
1  2019-05-07 03:00:00           25.0  ...  1.882              0.49505

[2 rows x 5 columns]

# 특정 로우 삭제하기

In [ ]:
air_quality.shape

(1035, 7)

In [ ]:
df = air_quality.drop([0,1],axis=0) # 0,1인덱스를 가지는 것을 삭제하고 싶음, axis=0은 default니까 써도되고 안써도 됨

In [ ]:
df

                 datetime  station_antwerp  ...   test  ratio_paris_antwerp
2     2019-05-07 04:00:00             45.0  ...  1.882             0.615556
3     2019-05-07 05:00:00              NaN  ...  1.882                  NaN
4     2019-05-07 06:00:00              NaN  ...  1.882                  NaN
5     2019-05-07 07:00:00              NaN  ...  1.882                  NaN
6     2019-05-07 08:00:00              NaN  ...  1.882                  NaN
...                   ...              ...  ...    ...                  ...
1030  2019-06-20 22:00:00              NaN  ...  1.882                  NaN
1031  2019-06-20 23:00:00              NaN  ...  1.882                  NaN
1032  2019-06-21 00:00:00              NaN  ...  1.882                  NaN
1033  2019-06-21 01:00:00              NaN  ...  1.882                  NaN
1034  2019-06-21 02:00:00              NaN  ...  1.882                  NaN

[1033 rows x 7 columns]

# 중복 데이터 삭제하기

In [ ]:
df = air_quality.drop_duplicates()

In [ ]:
df_1 = pd.DataFrame({'one':[1,2,1], 'two':[0,0,0]})
df_1

   one  two
0    1    0
1    2    0
2    1    0

In [ ]:
df_1.drop_duplicates()

   one  two
0    1    0
1    2    0

# element-wise function: apply

In [3]:
air_quality["london_mg_per_cubic"] = air_quality["station_london"]*1.882
air_quality.head(2)

              datetime  station_antwerp  ...  station_london  london_mg_per_cubic
0  2019-05-07 02:00:00              NaN  ...            23.0               43.286
1  2019-05-07 03:00:00             50.5  ...            19.0               35.758

[2 rows x 5 columns]

In [4]:
s = pd.Series([20,21,12], index = ['London','New York','Helsinki'])
s

London      20
New York    21
Helsinki    12
dtype: int64

In [7]:
def square(x):
  return x**2

In [8]:
square(10)

100

In [9]:
s.apply(square)

London      400
New York    441
Helsinki    144
dtype: int64

In [10]:
s.apply(lambda x :x**2)

London      400
New York    441
Helsinki    144
dtype: int64

In [13]:
air_quality = air_quality.drop(['london_mg_per_cubic'],axis=1)
air_quality

                 datetime  station_antwerp  station_paris  station_london
0     2019-05-07 02:00:00              NaN            NaN            23.0
1     2019-05-07 03:00:00             50.5           25.0            19.0
2     2019-05-07 04:00:00             45.0           27.7            19.0
3     2019-05-07 05:00:00              NaN           50.4            16.0
4     2019-05-07 06:00:00              NaN           61.9             NaN
...                   ...              ...            ...             ...
1030  2019-06-20 22:00:00              NaN           21.4             NaN
1031  2019-06-20 23:00:00              NaN           24.9             NaN
1032  2019-06-21 00:00:00              NaN           26.5             NaN
1033  2019-06-21 01:00:00              NaN           21.8             NaN
1034  2019-06-21 02:00:00              NaN           20.0             NaN

[1035 rows x 4 columns]

In [15]:
mean = air_quality.mean().mean()
mean

26.09885833343611

In [16]:
# air_quality df 안의 각 값들이 mean보다 큰지 작은지 계산

def level(x):
  if x >= mean:
    result = 'high'
  elif x < mean:
    result = 'low'
  else:
    result = x
  return result

In [18]:
air_quality['station_paris_level']=air_quality['station_paris'].apply(level)
air_quality.head(10)

              datetime  station_antwerp  ...  station_london  station_paris_level
0  2019-05-07 02:00:00              NaN  ...            23.0                  NaN
1  2019-05-07 03:00:00             50.5  ...            19.0                  low
2  2019-05-07 04:00:00             45.0  ...            19.0                 high
3  2019-05-07 05:00:00              NaN  ...            16.0                 high
4  2019-05-07 06:00:00              NaN  ...             NaN                 high
5  2019-05-07 07:00:00              NaN  ...            26.0                 high
6  2019-05-07 08:00:00              NaN  ...            32.0                 high
7  2019-05-07 09:00:00              NaN  ...            32.0                 high
8  2019-05-07 10:00:00              NaN  ...            28.0                 high
9  2019-05-07 11:00:00              NaN  ...            21.0                 high

[10 rows x 5 columns]

In [19]:
air_quality['station_paris'].apply(lambda x: 'high' if x >=mean else 'low')

0        low
1        low
2       high
3       high
4       high
        ...
1030     low
1031     low
1032    high
1033     low
1034     low
Name: station_paris, Length: 1035, dtype: object

# Calculate summary statistics

In [20]:
titanic = pd.read_csv('https://raw.githubusercontent.com/pandas-dev/pandas/master/doc/data/titanic.csv')
titanic.head(10)

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S
5            6         0       3  ...   8.4583   NaN         Q
6            7         0       1  ...  51.8625   E46         S
7            8         0       3  ...  21.0750   NaN         S
8            9         1       3  ...  11.1333   NaN         S
9           10         1       2  ...  30.0708   NaN         C

[10 rows x 12 columns]

In [21]:
titanic['Age'].mean()

29.69911764705882

In [22]:
titanic.mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [23]:
titanic[['Age','Fare']].mean()

Age     29.699118
Fare    32.204208
dtype: float64

In [24]:
titanic.describe()

       PassengerId    Survived      Pclass  ...       SibSp       Parch        Fare
count   891.000000  891.000000  891.000000  ...  891.000000  891.000000  891.000000
mean    446.000000    0.383838    2.308642  ...    0.523008    0.381594   32.204208
std     257.353842    0.486592    0.836071  ...    1.102743    0.806057   49.693429
min       1.000000    0.000000    1.000000  ...    0.000000    0.000000    0.000000
25%     223.500000    0.000000    2.000000  ...    0.000000    0.000000    7.910400
50%     446.000000    0.000000    3.000000  ...    0.000000    0.000000   14.454200
75%     668.500000    1.000000    3.000000  ...    1.000000    0.000000   31.000000
max     891.000000    1.000000    3.000000  ...    8.000000    6.000000  512.329200

[8 rows x 7 columns]

In [25]:
titanic.agg({'Age':['min','max'],'Fare':['min','max','mean']})

        Age        Fare
max   80.00  512.329200
mean    NaN   32.204208
min    0.42    0.000000

# Grouped by Category
SELECT Sex,AVG(Age)    
FROM titanic    
GROUP BY Sex

In [27]:
titanic.groupby('Sex')['Age'].mean()

Sex
female    27.915709
male      30.726645
Name: Age, dtype: float64

In [29]:
titanic.groupby(['Pclass','Sex'])['Fare'].mean()

Pclass  Sex
1       female    106.125798
        male       67.226127
2       female     21.970121
        male       19.741782
3       female     16.118810
        male       12.661633
Name: Fare, dtype: float64

# Count number of records by category

In [32]:
# class마다 승객이 몇명 있는지 확인
titanic.groupby('Pclass')['PassengerId'].count()

Pclass
1    216
2    184
3    491
Name: PassengerId, dtype: int64

In [33]:
# 위의 식을 더 간단하게 확인할 수 있는 함수: value_counts()
titanic['Pclass'].value_counts()

3    491
1    216
2    184
Name: Pclass, dtype: int64

In [34]:
titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [35]:
#연령 데이터에는 null값이 있음
#count는 null값을 세주지 않음
titanic.groupby('Pclass')['Age'].count()

Pclass
1    186
2    173
3    355
Name: Age, dtype: int64

In [36]:
# size의 경우 null값을 세줌
titanic.groupby('Pclass')['Age'].size()

Pclass
1    216
2    184
3    491
Name: Age, dtype: int64

In [37]:
titanic['Age'].value_counts()

24.00    30
22.00    27
18.00    26
19.00    25
30.00    25
         ..
55.50     1
70.50     1
66.00     1
23.50     1
0.42      1
Name: Age, Length: 88, dtype: int64

In [38]:
# value_counts가 null값을 제외하고 카운트 하는 것을 알 수 있음
titanic['Age'].value_counts().sum()

714

In [39]:
# null값도 카운트할 때는 dropna=False 넣어줌
titanic['Age'].value_counts(dropna=False)

NaN      177
24.00     30
22.00     27
18.00     26
28.00     25
        ...
36.50      1
55.50      1
66.00      1
23.50      1
0.42       1
Name: Age, Length: 89, dtype: int64

In [40]:
titanic['Age'].value_counts(dropna=False).sum()

891